{
  "architectures": [
    "CohereForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 5,
  "dtype": "bfloat16",
  "eos_token_id": 255001,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "layer_norm_eps": 1e-05,
  "logit_scale": 0.125,
  "max_position_embeddings": 8192,
  "model_type": "cohere",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pad_token_id": 0,
  "rope_scaling": null,
  "rope_theta": 10000,
  "transformers_version": "4.57.1",
  "use_cache": true,
  "use_qk_norm": false,
  "vocab_size": 256000
}
